if vim.g.vscode then
	-- vscode 版では vscode の keybindings を使用するため、nvim 側のキーマップは設定しない
	return
end

--------------------------------------------------------------------------------
-- 1. キーマッピングの基本設定
--------------------------------------------------------------------------------
local opts = { noremap = true, silent = true }
-- term_opts はターミナルモードのマッピングに使用できるが、現状では未使用
-- local term_opts = { silent = true }

-- nvim_set_keymap を使用
local keymap = vim.api.nvim_set_keymap

--------------------------------------------------------------------------------
-- 2. リーダーキー設定
--------------------------------------------------------------------------------
keymap("", "<Space>", "<Nop>", opts) -- <Space>を無効化
vim.g.mapleader = " " -- Leaderキーを <Space> に設定
vim.g.maplocalleader = " " -- ローカルリーダーキーも <Space> に設定

--------------------------------------------------------------------------------
-- 3. Normalモードのキーマッピング
--------------------------------------------------------------------------------
-- ウィンドウ移動を簡単に
keymap("n", "wh", "<C-w>h", opts)
keymap("n", "wj", "<C-w>j", opts)
keymap("n", "wk", "<C-w>k", opts)
keymap("n", "wl", "<C-w>l", opts)

-- 新しいタブを開く
keymap("n", "te", ":tabedit", opts)
-- 新しいタブを一番右に作成
keymap("n", "gn", ":tabnew<Return>", opts)
-- タブ移動
keymap("n", "gh", "gT", opts)
keymap("n", "gl", "gt", opts)

-- ウィンドウを分割
keymap("n", "sh", ":split<Return><C-w>w", opts)
keymap("n", "sv", ":vsplit<Return><C-w>w", opts)

-- 全選択
keymap("n", "<C-a>", "gg<S-v>G", opts)

-- x で削除してもヤンクしない
keymap("n", "x", '"_x', opts)

-- 単語を後ろ方向に削除 (dwの代わりに、ビジュアル選択して削除)
keymap("n", "dw", 'vb"_d', opts)

-- 行頭・行末へ移動
keymap("n", "<Space>h", "^", opts)
keymap("v", "<Space>h", "^", opts)
keymap("n", "<Space>l", "$", opts)
keymap("v", "<Space>l", "$", opts)

-- ; で : を入力 (コマンドライン呼び出し)
keymap("n", ";", ":", opts)

-- 行末までヤンク
keymap("n", "Y", "y$", opts)

-- 強制終了
keymap("n", "<Space>q", ":<C-u>q!<Return>", opts)

-- ハイライト解除 (ESCを2回押し)
keymap("n", "<Esc><Esc>", ":<C-u>set nohlsearch<Return>", opts)

--------------------------------------------------------------------------------
-- 4. Insertモードのキーマッピング
--------------------------------------------------------------------------------
-- jj でESC
keymap("i", "jj", "<ESC>", opts)

-- コンマの後にスペースを自動挿入
keymap("i", ",", ",<Space>", opts)

--------------------------------------------------------------------------------
-- 5. Visualモードのキーマッピング
--------------------------------------------------------------------------------
-- インデント後も選択を継続
keymap("v", "<", "<gv", opts)
keymap("v", ">", ">gv", opts)

-- 0番レジスタ貼り付けを簡単に
keymap("v", "<C-p>", '"0p', opts)

-- （例）ビジュアルモード時、"v"を押したら行末まで選択 (コメントアウト中)
-- keymap("v", "v", "$h", opts)

--------------------------------------------------------------------------------
-- 6. LSP関連
--------------------------------------------------------------------------------
require("plugins_config.dap_keymaps")
